export const intro = {
  title: "معرفی دفتر وکالت آل محمد",
  }


export type HistoryItem = {
  year: string;
  yearEnd?: string; // اگه باشه، رویداد بازه‌ایه و دو دایره می‌گیره
  title: string;
  paragraphs: string[];
  image?: string;
};

export const history: HistoryItem[] = [
  {
    year: "۱۳۵۲",
    title: "تأسیس دفتر وکالت آل‌محمد",
    paragraphs: [
      "دفتر وکالت آل‌محمد از سال ۱۳۵۲ به طور رسمی فعالیت خود را در زمینه ارائه مشاوره حقوقی تخصصی و وکالت در دعاوی مختلف آغاز کرد.",
      "این دفتر خدمات حقوقی خود را به ایرانیان داخل و خارج از کشور و همچنین اتباع خارجی مواجه با مسائل حقوقی در ایران ارائه می‌دهد.",
    ],
    image: "/images/timeline/IMG_3044.jpg",
  },
  {
    year: "۱۳۵۸",
    title: "نمایندگی ایران در دعاوی بین‌المللی",
    paragraphs: [
      "سید محمد صادق آل محمد به عنوان وکیل ایران از سوی سازمان آب و برق خوزستان در دادگاه بین‌المللی لاهه حضور یافت.",
    ],
    image: "/images/timeline/IMG_3040.jpg",
  },
  {
    year: "۱۳۸۱",
    title: "رسیدگی به پرونده‌های کلان اقتصادی",
    paragraphs: [
      "وکالت اولین و بزرگترین پرونده اقتصادی کشور به ارزش ۵۰ میلیون دلار بر عهده دفتر بود.",
    ],
    image: "/images/timeline/IMG_3041.jpg",
  },
  {
    year: "۱۳۸۵",
    title: "ورود سید امین آل‌محمد",
    paragraphs: [
      "در سال ۱۳۸۵، سید امین آل‌محمد موفق به اخذ پروانه وکالت از کانون وکلای دادگستری مرکز شد و به تیم حقوقی دفتر پیوست.",
    ],
    image: "/images/timeline/IMG_3042.jpg",
  },
  {
    year: "۱۳۹۰",
    title: "ورود سید امیر آل‌محمد",
    paragraphs: [
      "در سال ۱۳۹۰، سید امیر آل‌محمد نیز به عنوان وکیل رسمی کانون وکلای دادگستری مرکز فعالیت حرفه‌ای خود را در دفتر آغاز کرد.",
    ],
    image: "/images/timeline/IMG_3040.jpg",
  },
  {
    year: "۱۳۹۵",
  yearEnd: "۱۴۰۵",
    title: "فعالیت حرفه‌ای در کانون وکلا",
   paragraphs: [
  "عضویت در کمیسیون جوانان کانون وکلای مرکز (۱۳۹۵–۱۳۹۷) و عضویت در کمیسیون معاضدت قضایی کانون وکلای دادگستری مرکز (۱۳۹۷–۱۴۰۵).",
],image: "/images/timeline/IMG_3042.jpg",
  },
];


export type HighlightBlock = {
  heading?: string;
  text: string;
};

export type Highlight = {
  title: string;
  blocks: HighlightBlock[];
};

export const highlights: Highlight[] = [
  {
    title: "۳۰ سال",
    blocks: [
      {
        heading: "مشاوره حقوقی مستمر",
        text: "همکاری با سازمان آب و برق خوزستان به مدت ۳۰ سال.",
      },
    ],
  },
  {
    title: "نقش‌های مدیریتی",
    blocks: [
      {
        text: "دو دوره ریاست کانون وکلای خوزستان و لرستان و حضور در نهادهای حرفه‌ای وکالت.",
      },
      {
        text: "نمایندگی کانون خوزستان در اتحادیه سراسری کانون‌های وکلا ایران (اسکودا).",
      },
    ],
  },
  {
    title: "حضور بین‌المللی",
    blocks: [
      {
        heading: "واشنگتن دی‌سی",
        text: "اخذ مجوز برای ارائه خدمات مشاوره به ایرانیان مقیم آمریکا.",
      },
      {
        heading: "1844iranlaw",
        text: "تأسیس دفتر ارائه خدمات حقوقی به ایرانیان مقیم آمریکا و پیگیری مسائل حقوقی مرتبط با ایران.",
      },
    ],
  },
];